// 给定平面上任意三个点的坐标(x 1 ,y 1)、(x 2 ,y 2)、(x 3 ,y 3)，检验它们能否构成三角形。
// 输入格式: 输入在一行中顺序给出六个[−100,100]范围内的数字，即三个点的坐标x 1 、y 1 、x 2 、y 2 、x 3 、y 3 。 
// 输出格式: 若这3个点不能构成三角形，则在一行中输出“Impossible”；若可以，则在一行中输出该三角形的周长和面积，格式为“L = 周长, A = 面积”，输出到小数点后2位。

// 输入样例1:
// 4 5 6 9 7 8
// 输出样例1:
// L = 10.13, A = 3.00
// 输入样例2:
// 4 6 8 12 12 18
// 输出样例2:
// Impossible

#include<stdio.h>
#include<math.h>
int main(){
	double x1,y1,x2,y2,x3,y3,l1,l2,l3,p,l,s;
	scanf("%lf%lf%lf%lf%lf%lf",&x1,&y1,&x2,&y2,&x3,&y3);
	//判断两条线是否平行，斜率是否相同
    //平面直角坐标系中任选三个点，除了三点共线情况外都能构成三角形 
	 if((y1-y2)/(x1-x2)!=(y2-y3)/(x2-x3)){
	 	//两点之间距离公式 
	 	l1=sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2));
		l2=sqrt((x2-x3)*(x2-x3)+(y2-y3)*(y2-y3));
		l3=sqrt((x1-x3)*(x1-x3)+(y1-y3)*(y1-y3));
		l=l1+l2+l3;
		//海伦公式 
	 	p=(l1+l2+l3)/2;
	 	s=sqrt(p*(p-l1)*(p-l2)*(p-l3));
	 	printf("L = %.2f, A = %.2f",l,s);
	 }else
		printf("Impossible");
	return 0;
}
//排除三点共线的情况。两条线斜率不相等即可。
