// 给定一个n×n的方阵，本题要求计算该矩阵除副对角线、最后一列和最后一行以外的所有元素之和。副对角线为从矩阵的右上角至左下角的连线。

// 输入格式: 输入第一行给出正整数n（1<n≤10）；随后n行，每行给出n个整数，其间以空格分隔。

// 输出格式: 在一行中给出该矩阵除副对角线、最后一列和最后一行以外的所有元素之和。 

// 输入样例:
// 4
// 2 3 4 1
// 5 6 1 1
// 7 1 8 1
// 1 1 1 1
// 输出样例:
// 35

#include<stdio.h>
int main()
{
    int n,i,j;
    int sum=0;
    scanf("%d",&n);
    int a[n][n];
    if(n<=1||n>10){
        printf("error");
    }
    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            scanf("%d",&a[i][j]);
            }
        }
    //求和
    //第一步直接不加最后一行和最后一列的元素 
    for(i=0;i<n-1;i++){
        for(j=0;j<n-1;j++){
            sum+=a[i][j];
        }
    }
	//第二步减去副对角线上的元素，两头重合元素不再进行处理，故i从第二行开始，j从倒数第二列开始； 
	//则i初始值为1，j的初始值为n-2，并对i和j的范围进行控制（二者上下限交换），表达式3中i自增，j自减； 
	//注意引入逗号表达式，二者同时进行运算 。 
	
    for(i=1,j=n-2;i<=n-2,j>0;i++,j--){
        sum-=a[i][j];
    }
    printf("%d",sum);
    return 0;
}
//话说之前有个高中同学在班级群里发了一个矩阵运算器的C语言代码...感觉相当厉害。。
